---

C#Visual BasicVisual C++

Revit 2024 API
---
ViewNode..::..GetCameraInfo Method
ViewNode Class See Also Send Feedback
---

Information about the observation point (the camera) of the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014

# Syntax

C#
---

    public CameraInfo GetCameraInfo()

Visual Basic
---

    Public Function GetCameraInfo As CameraInfo

Visual C++
---

    public:
    CameraInfo^ GetCameraInfo()

#### Return Value

An instance of CameraInfo or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no info associated with the view

# See Also

ViewNode Class

Autodesk.Revit.DB Namespace